Revit 2024 API
LabelUtils Class
 Used to obtain user-visible names for enums.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class LabelUtils : IDisposable
Visual Basic
Public Class LabelUtils _
	Implements IDisposable
Visual C++
public ref class LabelUtils : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LabelUtils
See Also
LabelUtils Members
Autodesk.Revit.DB Namespace